Revit 2027 API
RoutingConditions Methods
The RoutingConditions type exposes the following members.
Methods
Name | Description
AppendCondition |  Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector.
Clear |  Clear all existing conditions
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetConditionAt |  Gets the routing condition at the specified index position.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetNumberOfConditions |  Gets the number of included routing conditions.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RoutingConditions Class
Autodesk.Revit.DB Namespace